import React from 'react';
import Card from "../../Card/Card";

const Section2 = () => {
    const info = [
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
        {
            title: "کیک کدو حلوایی",
            url: "hossein-heydari.ir",
            description: "این مطلب درمورد پرده اتاق کودک بسیار زیبا و شیک است . این مطلب از سایت اتاق میباشد . برای مشاده ی کامل این مطلب به سایت اتاق مراجعه کنید"
        },
    ]
    return (
        <div className={"flex flex-wrap gap-5 justify-evenly mt-8"}>
            {
                info.map(({title, url, description}) => {
                    return <Card title={title} url={url} description={description}/>
                })
            }
        </div>
    );
};

export default Section2;